In [2]:
import pandas as pd

series = pd.Series([4,8,145,16,23,42])
print(series)

0      4
1      8
2    145
3     16
4     23
5     42
dtype: int64

In [3]:
var = ['First_value','Second_value','Third_value','Forth_value','Fifth_value','Sixth_value','Seventh_value','Eightth_value','Ninth_Value','Tenth_value']

sr = pd.Series(var)
print(sr)

0      First_value
1     Second_value
2      Third_value
3      Forth_value
4      Fifth_value
5      Sixth_value
6    Seventh_value
7    Eightth_value
8      Ninth_Value
9      Tenth_value
dtype: object

In [5]:
data = {
    'Name': ['Alice','Bob','Claire'],
    'Age' : [25,30,27],
    'Gender' : ['Female','Male','Female']
}

df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
DataFrame ; DataFrame is like a table where we can put structured and tabular data. it is 1 or more dimentional
Series : Series is like a list it is 1 dimentional

In [11]:
data = {
    'Name': ['Alice','Bob','Claire'],
    'Age' : [25,30,27],
    'Gender' : ['Female','Male','Female']
}

df = pd.DataFrame(data)

# Series
df['Name']

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [12]:
# Data Frame
df[['Name']]

     Name
0   Alice
1     Bob
2  Claire

In [ ]:
Describe : It is use for describring the data
info : Info is use for getting information from the data
shape : shape is used to get dimention of the data
dtype : dtype is use to know the data type

Data Manupulation

In [17]:
data = {
    'Name': ['Alice','Bob','Claire'],
    'Age' : [25,30,27],
    'Gender' : ['Female','Male','Female']
}

df = pd.DataFrame(data)

df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [19]:
df.dtypes

Name      object
Age        int64
Gender    object
dtype: object

In [20]:
df.shape

(3, 3)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

Mutable and immutable in Pandas

In [ ]:
Series : Immutable
DataFrame : Mutable
Panel : Immutable

In [24]:
# Create a DataFrame using Multiple series

Name = pd.Series(['Alice','Bob','Claire'])
Age = pd.Series([25,30,27]) 
Gender = pd.Series(['Female','Male','Female'])

df = pd.DataFrame()

df['Name'] = Name
df['Age'] = Age
df['Gender'] = Gender